In [1]:
import pandas as pd
from pandas_datareader import data

In [4]:
companies = ["MSFT", "GOOG", "AAPL", "YHOO", "AMZN"]

p = data.DataReader(companies, data_source="google", start="2010-01-01",
                end="2016-12-31")
p

<class 'pandas.core.panel.Panel'>
Dimensions: 5 (items) x 1761 (major_axis) x 5 (minor_axis)
Items axis: Open to Volume
Major_axis axis: 2010-01-04 00:00:00 to 2016-12-30 00:00:00
Minor_axis axis: AAPL to YHOO

In [6]:
p.items

Index(['Open', 'High', 'Low', 'Close', 'Volume'], dtype='object')

In [14]:
p.axes

[Index(['Open', 'High', 'Low', 'Close', 'Volume'], dtype='object'),
 DatetimeIndex(['2010-01-04', '2010-01-05', '2010-01-06', '2010-01-07',
                '2010-01-08', '2010-01-11', '2010-01-12', '2010-01-13',
                '2010-01-14', '2010-01-15',
                ...
                '2016-12-16', '2016-12-19', '2016-12-20', '2016-12-21',
                '2016-12-22', '2016-12-23', '2016-12-27', '2016-12-28',
                '2016-12-29', '2016-12-30'],
               dtype='datetime64[ns]', name='Date', length=1761, freq=None),
 Index(['AAPL', 'AMZN', 'GOOG', 'MSFT', 'YHOO'], dtype='object')]

# Panel Attributes

In [15]:
p.ndim

3

In [16]:
p.dtypes

Open      float64
High      float64
Low       float64
Close     float64
Volume    float64
dtype: object

In [17]:
p.shape

(5, 1761, 5)

In [18]:
p.size

44025

In [20]:
p.values[:1]

array([[[  30.49,  136.25,  313.16,   30.62,   16.94],
        [  30.66,  133.43,  313.28,   30.85,   17.22],
        [  30.63,  134.6 ,  312.62,   30.88,   17.17],
        ...,
        [ 117.52,  776.25,  793.7 ,   63.4 ,   39.12],
        [ 116.45,  772.4 ,  783.33,   62.86,   38.76],
        [ 116.65,  766.47,  782.75,   62.96,   38.72]]])

# Extract DFs

In [21]:
p["Open"].head()

             AAPL    AMZN    GOOG   MSFT   YHOO
Date
2010-01-04  30.49  136.25  313.16  30.62  16.94
2010-01-05  30.66  133.43  313.28  30.85  17.22
2010-01-06  30.63  134.60  312.62  30.88  17.17
2010-01-07  30.25  132.01  304.40  30.63  16.81
2010-01-08  30.04  130.56  295.70  30.28  16.68

In [22]:
p["Volume"].loc["2010-01-04"]

AAPL    123432050.0
AMZN      7600543.0
GOOG            NaN
MSFT     38414185.0
YHOO     16588957.0
Name: 2010-01-04 00:00:00, dtype: float64

In [24]:
p.loc["High"].head(3)

             AAPL    AMZN    GOOG   MSFT   YHOO
Date
2010-01-04  30.64  136.61  314.44  31.10  17.20
2010-01-05  30.80  135.48  313.61  31.10  17.23
2010-01-06  30.75  134.73  312.62  31.08  17.30

In [27]:
p.loc["High"].loc["2010-01-04"]

AAPL     30.64
AMZN    136.61
GOOG    314.44
MSFT     31.10
YHOO     17.20
Name: 2010-01-04 00:00:00, dtype: float64

In [26]:
p.loc["High", "2010-01-04"]

AAPL     30.64
AMZN    136.61
GOOG    314.44
MSFT     31.10
YHOO     17.20
Name: 2010-01-04 00:00:00, dtype: float64

In [28]:
p.loc["High", "2010-01-04", "AAPL"]

30.640000000000001

In [31]:
p.iloc[1].head(3)

             AAPL    AMZN    GOOG   MSFT   YHOO
Date
2010-01-04  30.64  136.61  314.44  31.10  17.20
2010-01-05  30.80  135.48  313.61  31.10  17.23
2010-01-06  30.75  134.73  312.62  31.08  17.30

In [32]:
p.iloc[1, 0]

AAPL     30.64
AMZN    136.61
GOOG    314.44
MSFT     31.10
YHOO     17.20
Name: 2010-01-04 00:00:00, dtype: float64

In [33]:
p.iloc[1, 0, 0]

30.640000000000001

# Panel to MultiIndex DF

In [36]:
df = p.to_frame()
df.head(10)

                    Open    High     Low   Close       Volume
Date       minor
2010-01-04 AAPL    30.49   30.64   30.34   30.57  123432050.0
           AMZN   136.25  136.61  133.14  133.90    7600543.0
           MSFT    30.62   31.10   30.59   30.95   38414185.0
           YHOO    16.94   17.20   16.88   17.10   16588957.0
2010-01-05 AAPL    30.66   30.80   30.46   30.63  150476004.0
           AMZN   133.43  135.48  131.81  134.69    8856456.0
           MSFT    30.85   31.10   30.64   30.96   49758862.0
           YHOO    17.22   17.23   17.00   17.23   11718126.0
2010-01-06 AAPL    30.63   30.75   30.11   30.14  138039594.0
           AMZN   134.60  134.73  131.65  132.25    7180977.0

In [50]:
df = df.unstack().stack(0)
df.head(10)

minor                      AAPL        AMZN  GOOG         MSFT         YHOO
Date
2010-01-04 Close   3.049000e+01      136.25   NaN        30.62        16.94
           High    3.064000e+01      136.61   NaN        31.10        17.20
           Low     3.034000e+01      133.14   NaN        30.59        16.88
           Open    3.057000e+01      133.90   NaN        30.95        17.10
           Volume  1.234320e+08  7600543.00   NaN  38414185.00  16588957.00
2010-01-05 Close   3.066000e+01      133.43   NaN        30.85        17.22
           High    3.080000e+01      135.48   NaN        31.10        17.23
           Low     3.046000e+01      131.81   NaN        30.64        17.00
           Open    3.063000e+01      134.69   NaN        30.96        17.23
           Volume  1.504760e+08  8856456.00   NaN  49758862.00  11718126.00

# The .major_xs() Method

In [52]:
p.major_axis

DatetimeIndex(['2010-01-04', '2010-01-05', '2010-01-06', '2010-01-07',
               '2010-01-08', '2010-01-11', '2010-01-12', '2010-01-13',
               '2010-01-14', '2010-01-15',
               ...
               '2016-12-16', '2016-12-19', '2016-12-20', '2016-12-21',
               '2016-12-22', '2016-12-23', '2016-12-27', '2016-12-28',
               '2016-12-29', '2016-12-30'],
              dtype='datetime64[ns]', name='Date', length=1761, freq=None)

In [53]:
p.major_xs("2010-01-04")

        Open    High     Low   Close       Volume
AAPL   30.49   30.64   30.34   30.57  123432050.0
AMZN  136.25  136.61  133.14  133.90    7600543.0
GOOG  313.16  314.44  311.81  313.06          NaN
MSFT   30.62   31.10   30.59   30.95   38414185.0
YHOO   16.94   17.20   16.88   17.10   16588957.0

# The .minor_xs() Method

In [54]:
p.minor_axis

Index(['AAPL', 'AMZN', 'GOOG', 'MSFT', 'YHOO'], dtype='object')

In [56]:
p.minor_xs("MSFT").head()

             Open   High    Low  Close      Volume
Date
2010-01-04  30.62  31.10  30.59  30.95  38414185.0
2010-01-05  30.85  31.10  30.64  30.96  49758862.0
2010-01-06  30.88  31.08  30.52  30.77  58182332.0
2010-01-07  30.63  30.70  30.19  30.45  50564285.0
2010-01-08  30.28  30.88  30.24  30.66  51201289.0

# The .transpose() Method

In [57]:
p

<class 'pandas.core.panel.Panel'>
Dimensions: 5 (items) x 1761 (major_axis) x 5 (minor_axis)
Items axis: Open to Volume
Major_axis axis: 2010-01-04 00:00:00 to 2016-12-30 00:00:00
Minor_axis axis: AAPL to YHOO

In [62]:
# items, major, minor, from the position they are before transposing
new_p = p.transpose(2, 1, 0)
new_p

<class 'pandas.core.panel.Panel'>
Dimensions: 5 (items) x 1761 (major_axis) x 5 (minor_axis)
Items axis: AAPL to YHOO
Major_axis axis: 2010-01-04 00:00:00 to 2016-12-30 00:00:00
Minor_axis axis: Open to Volume

In [65]:
new_df = new_p.to_frame()
new_df.head(10)

                   AAPL    AMZN    GOOG   MSFT   YHOO
Date       minor
2010-01-04 Open   30.49  136.25  313.16  30.62  16.94
           High   30.64  136.61  314.44  31.10  17.20
           Low    30.34  133.14  311.81  30.59  16.88
           Close  30.57  133.90  313.06  30.95  17.10
2010-01-05 Open   30.66  133.43  313.28  30.85  17.22
           High   30.80  135.48  313.61  31.10  17.23
           Low    30.46  131.81  310.46  30.64  17.00
           Close  30.63  134.69  311.68  30.96  17.23
2010-01-06 Open   30.63  134.60  312.62  30.88  17.17
           High   30.75  134.73  312.62  31.08  17.30

# The .swapaxes() Method

In [66]:
p

<class 'pandas.core.panel.Panel'>
Dimensions: 5 (items) x 1761 (major_axis) x 5 (minor_axis)
Items axis: Open to Volume
Major_axis axis: 2010-01-04 00:00:00 to 2016-12-30 00:00:00
Minor_axis axis: AAPL to YHOO

In [69]:
p.swapaxes("items", "minor")

/home/henrique/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
Panel is deprecated and will be removed in a future version.
The recommended way to represent these types of 3-dimensional data are with a MultiIndex on a DataFrame, via the Panel.to_frame() method
Alternatively, you can use the xarray package http://xarray.pydata.org/en/stable/.
Pandas provides a `.to_xarray()` method to help automate this conversion.

  """Entry point for launching an IPython kernel.

<class 'pandas.core.panel.Panel'>
Dimensions: 5 (items) x 1761 (major_axis) x 5 (minor_axis)
Items axis: AAPL to YHOO
Major_axis axis: 2010-01-04 00:00:00 to 2016-12-30 00:00:00
Minor_axis axis: Open to Volume